In [1]:
import pandas as pd
import numpy as np

In [54]:
df= pd.read_csv('Churn_Prediction.csv')
df.head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [3]:
df['countries'] = df['country'].apply(lambda x: 0 if x == 'France' else (1 if x == 'Germany' else 2))
df['gender_data'] = df['gender'].apply(lambda x: 0 if x=='Male' else 1)

In [4]:
df.drop(['country', 'gender'], axis=1, inplace=True)

In [45]:
# X = df.drop('churn', axis=1).values
X = df.iloc[:,[8,9]].values
y = df['churn']

In [46]:
X

array([[1.0134888e+05, 1.0000000e+00],
       [1.1254258e+05, 0.0000000e+00],
       [1.1393157e+05, 1.0000000e+00],
       ...,
       [4.2085580e+04, 1.0000000e+00],
       [9.2888520e+04, 1.0000000e+00],
       [3.8190780e+04, 0.0000000e+00]])

In [47]:
from sklearn.cluster import DBSCAN
ds = DBSCAN(eps=4, min_samples=5)
model = ds.fit(X)
labels = model.labels_

In [48]:
from sklearn import metrics

In [49]:
sample_cores = np.zeros_like(labels, dtype=bool)
sample_cores[ds.core_sample_indices_] = True

In [50]:
n_clusters = len(set(labels)) - (1 if -1 in labels else 0)

In [51]:
n_clusters

3